backend: tensorflow
class_name: Model
config:
  input_layers:
  - [left_features, 0, 0]
  - [central_features, 0, 0]
  - [right_features, 0, 0]
  - [left_metas, 0, 0]
  - [right_metas, 0, 0]
  - [central_metas, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: left_features
      sparse: false
    inbound_nodes: []
    name: left_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: left_metas
      sparse: false
    inbound_nodes: []
    name: left_metas
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 233]
      dtype: float32
      name: right_features
      sparse: false
    inbound_nodes: []
    name: right_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 16, 22]
      dtype: float32
      name: right_metas
      sparse: false
    inbound_nodes: []
    name: right_metas
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_13, trainable: true}
    inbound_nodes:
    - - - left_features
        - 0
        - 0
        - &id001 {}
      - - left_metas
        - 0
        - 0
        - *id001
    name: concatenate_13
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_14, trainable: true}
    inbound_nodes:
    - - - right_features
        - 0
        - 0
        - &id002 {}
      - - right_metas
        - 0
        - 0
        - *id002
    name: concatenate_14
  - class_name: Dropout
    config: {name: dropout_7, rate: 0.2, trainable: true}
    inbound_nodes:
    - - - concatenate_13
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Dropout
    config: {name: dropout_8, rate: 0.2, trainable: true}
    inbound_nodes:
    - - - concatenate_14
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_left
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_5
      trainable: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: time_distributed_5
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          batch_input_shape: !!python/tuple [null, 255]
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: embedding_right
          trainable: true
          units: 200
          use_bias: true
      name: time_distributed_6
      trainable: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: time_distributed_6
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_5
        - 0
        - 0
        - {}
    name: lstm_left_0
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_0
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - time_distributed_6
        - 0
        - 0
        - {}
    name: lstm_right_0
  - class_name: Activation
    config: {activation: relu, name: activation_9, trainable: true}
    inbound_nodes:
    - - - lstm_left_0
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 179]
      dtype: float32
      name: central_features
      sparse: false
    inbound_nodes: []
    name: central_features
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 22]
      dtype: float32
      name: central_metas
      sparse: false
    inbound_nodes: []
    name: central_metas
  - class_name: Activation
    config: {activation: relu, name: activation_10, trainable: true}
    inbound_nodes:
    - - - lstm_right_0
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Add
    config: {name: add_5, trainable: true}
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - &id003 {}
      - - time_distributed_5
        - 0
        - 0
        - *id003
    name: add_5
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_15, trainable: true}
    inbound_nodes:
    - - - central_features
        - 0
        - 0
        - &id004 {}
      - - central_metas
        - 0
        - 0
        - *id004
    name: concatenate_15
  - class_name: Add
    config: {name: add_6, trainable: true}
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - &id005 {}
      - - time_distributed_6
        - 0
        - 0
        - *id005
    name: add_6
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_left_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: lstm_left_1
  - class_name: Dropout
    config: {name: dropout_9, rate: 0.2, trainable: true}
    inbound_nodes:
    - - - concatenate_15
        - 0
        - 0
        - {}
    name: dropout_9
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_right_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 200
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: lstm_right_1
  - class_name: Activation
    config: {activation: relu, name: activation_11, trainable: true}
    inbound_nodes:
    - - - lstm_left_1
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x05\0\0\0S\0\0\0\
          s\x16\0\0\0|\0d\0d\0\N\x02d\x02d\0d\0\N\x02f\x03\x19\0S\0)\x03N\xE9\x01\0\
          \0\0\xE9\xFF\xFF\xFF\xFF\xA9\0)\x01\xDA\x01tr\x03\0\0\0r\x03\0\0\0\xFA</home/gaetan/Projets/Python/workspace/DeepBach/models_zoo.py\xDA\
          \b<lambda>\x9B\0\0\0\xF3\0\0\0\0", null, null]
      function_type: lambda
      name: lambda_5
      output_shape: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x03\0\0\0S\0\
          \0\0s\x10\0\0\0|\0d\x01\x19\0|\0d\x03\x19\0f\x02S\0)\x04N\xE9\0\0\0\0\xE9\
          \x01\0\0\0\xE9\xFF\xFF\xFF\xFF\xA9\0)\x01\xDA\vinput_shaper\x04\0\0\0r\x04\
          \0\0\0z</home/gaetan/Projets/Python/workspace/DeepBach/models_zoo.py\xDA\
          \b<lambda>\x9C\0\0\0\xF3\0\0\0\0", null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - lstm_left_0
        - 0
        - 0
        - {}
    name: lambda_5
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_7
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - dropout_9
        - 0
        - 0
        - {}
    name: dense_7
  - class_name: Activation
    config: {activation: relu, name: activation_12, trainable: true}
    inbound_nodes:
    - - - lstm_right_1
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x05\0\0\0S\0\0\0\
          s\x16\0\0\0|\0d\0d\0\N\x02d\x02d\0d\0\N\x02f\x03\x19\0S\0)\x03N\xE9\x01\0\
          \0\0\xE9\xFF\xFF\xFF\xFF\xA9\0)\x01\xDA\x01tr\x03\0\0\0r\x03\0\0\0\xFA</home/gaetan/Projets/Python/workspace/DeepBach/models_zoo.py\xDA\
          \b<lambda>\x9E\0\0\0\xF3\0\0\0\0", null, null]
      function_type: lambda
      name: lambda_6
      output_shape: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x03\0\0\0S\0\
          \0\0s\x10\0\0\0|\0d\x01\x19\0|\0d\x03\x19\0f\x02S\0)\x04N\xE9\0\0\0\0\xE9\
          \x01\0\0\0\xE9\xFF\xFF\xFF\xFF\xA9\0)\x01\xDA\vinput_shaper\x04\0\0\0r\x04\
          \0\0\0z</home/gaetan/Projets/Python/workspace/DeepBach/models_zoo.py\xDA\
          \b<lambda>\x9F\0\0\0\xF3\0\0\0\0", null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - lstm_right_0
        - 0
        - 0
        - {}
    name: lambda_6
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_16, trainable: true}
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - &id006 {}
      - - lambda_5
        - 0
        - 0
        - *id006
    name: concatenate_16
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_8
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - dense_7
        - 0
        - 0
        - {}
    name: dense_8
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_17, trainable: true}
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - &id007 {}
      - - lambda_6
        - 0
        - 0
        - *id007
    name: concatenate_17
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_18, trainable: true}
    inbound_nodes:
    - - - concatenate_16
        - 0
        - 0
        - &id008 {}
      - - dense_8
        - 0
        - 0
        - *id008
      - - concatenate_17
        - 0
        - 0
        - *id008
    name: concatenate_18
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_9
      trainable: true
      units: 200
      use_bias: true
    inbound_nodes:
    - - - concatenate_18
        - 0
        - 0
        - {}
    name: dense_9
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: pitch_prediction
      trainable: true
      units: 54
      use_bias: true
    inbound_nodes:
    - - - dense_9
        - 0
        - 0
        - {}
    name: pitch_prediction
  name: model_3
  output_layers:
  - [pitch_prediction, 0, 0]
keras_version: 2.0.2
